app/controllers/schools_controller.rb

  def index
    @schools = School.all
---
SELECT "schools".* FROM "schools"

  def create
    @school = School.new(school_params)

    respond_to do |format|
      if @school.save
---
INSERT INTO "schools" ("name", "number_of_dep", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Something"], ["number_of_dep", 2], ["created_at", "2015-12-21 14:59:31.530378"], ["updated_at", "2015-12-21 14:59:31.530378"]]

  def destroy
    @school.destroy
---
DELETE FROM "schools" WHERE "schools"."id" = ?  [["id", 1]]

    def set_school
      @school = School.find(params[:id])
---
SELECT  "schools".* FROM "schools" WHERE "schools"."id" = ? LIMIT 1  [["id", 2]]