app/controllers/students_controller.rb

SELECT "students".* FROM "students"
INSERT INTO "students" ("name", "is_girl", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "Sanja Sanjic"], ["is_girl", "f"], ["created_at", "2015-12-21 17:11:52.203657"], ["updated_at", "2015-12-21 17:11:52.203657"]]
---
  def index
    @students = Student.all

    names_table = ["Pera", "Mika", "Zika", "Sanja", "Tanja", "Vanja", "Rasa", "Ceca", "Jaca", "Mica", "Steva"]
        @pupils = Hash.new
        @st_count = rand(90..110)
        for i in 0..@st_count
            rand_name = names_table[rand(0..names_table.length-1)]
            rand_surname = names_table[rand(0..names_table.length-1)][0..-2] + "ic"
            rand(0..1) == 1 ? is_girl = "girl" : is_girl = "boy"
            @pupils["name"] = rand_name+" "+rand_surname
            if(is_girl == "girl")
              @pupils["is_girl"] = true
            else
              @pupils["is_girl"] = false
            end
            @pupils["is_special"] = false
            @student = Student.new(@pupils)
            @student.save

UPDATE "students" SET "is_special" = ?, "updated_at" = ? WHERE "students"."id" = ?  [["is_special", "t"], ["updated_at", "2015-12-21 17:21:56.995439"], ["id", 1]]
---
  def update
    respond_to do |format|
      if @student.update(student_params)

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 110]]
---
    def set_student
      @student = Student.find(params[:id])